rails/app/views/locations/show.html.erb

SELECT  `events`.* FROM `events` WHERE `events`.`location_id` = 1 ORDER BY `events`.`id` ASC LIMIT 1
---
<strong>eve:</strong>
<%= @location.events.first.kind %>