rails/app/controllers/event_users_controller.rb

  def index
    @event_users = EventUser.all
---
SELECT `event_users`.* FROM `event_users`

    def set_event_user
      @event_user = EventUser.find(params[:id])
---
SELECT  `event_users`.* FROM `event_users` WHERE `event_users`.`id` = 2 LIMIT 1