api/app/controllers/events_controller.rb

  def index

    print params
    if params[:search]
      @orders = Event.where(kind:params[:search].capitalize)
      index = params[:page].to_i
      page_size = params[:pagesize].to_i
      start = index * page_size
      render :json => @orders.to_json(:include => :host)
    else
      @events = Event.all
---
SELECT "events".* FROM "events" WHERE "events"."kind" = $1  [["kind", "Gg"]]
SELECT "events".* FROM "events"

  def show
    @event = Event.find(params[:event_id] || params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]