api/app/controllers/event_comments_controller.rb

SELECT "event_comments".* FROM "event_comments"
---
  def index
    @event_comments = EventComment.all

SELECT  "event_comments".* FROM "event_comments" WHERE "event_comments"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_event_comment
      @event_comment = EventComment.find(params[:id])