api/app/controllers/guests_controller.rb

  def show
    @guest = Guest.find(params[:guest_id] || params[:id])
---
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT 1  [["id", 1]]