api/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "yes"], ["body", "mate"], ["created_at", "2017-10-29 11:02:42.843830"], ["updated_at", "2017-10-29 11:02:42.843830"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save